Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.RebarGuidelineGetActualCurve(System.Int32,System.Int32,Tekla.Structures.DirectManipulation.Model.Native.dotCurve_t@)
Gets the guideline 'actual' curve.
id: The guideline ID.
rebarsetId: The rebarset ID.
actualCurve: The actual curve.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Model.Native.INativeDllImport.ComponentGetAppliedAttributes(Tekla.Structures.ModelInternal.dotBaseComponent_t@,Tekla.Structures.ModelInternal.dotGetProperties_t@)
Gets components applied attributes method.
pBaseComponent: The component.
pProperties: The properties.